Тестовая_база_ERP_14/src/InformationRegisters/ПорядокОтраженияРасходов/ПорядокОтраженияРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПорядокОтраженияРасходов</name>
  <resources>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ОтражениеВУСН</name>
    <type>
      <types>EnumRef.ОтражениеВУСН</types>
    </type>
  </resources>
  <resources>
    <name>СпособНастройкиСчетовУчета</name>
    <type>
      <types>EnumRef.СпособыНастройкиСчетовУчета</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаНУ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходовНУ</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>ВидСубконто</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>ВидСубконтоНУ</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>СчетСписанияОСНО</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетСписанияЕНВД</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.СписаниеНедостачТоваров</types>
      <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
      <types>DocumentRef.ОтчетБанкаПоОперациямЭквайринга</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.СписаниеЗадолженности</types>
      <types>DocumentRef.ОтчетКомиссионераОСписании</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.НачисленияКредитовИДепозитов</types>
      <types>DocumentRef.ПередачаМатериаловВПроизводство</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/СчетаРеглУчетаТребующиеНастройки/СчетаРеглУчетаТребующиеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СчетаРеглУчетаТребующиеНастройки</name>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>CatalogRef.КатегорииЭксплуатации</types>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
      <types>CatalogRef.ГруппыФинансовогоУчетаВнеоборотныхАктивов</types>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
      <types>CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</types>
      <types>CatalogRef.Кассы</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
      <types>CatalogRef.ВидыПодарочныхСертификатов</types>
      <types>CatalogRef.Резервы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоУчета</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСчета</name>
    <type>
      <types>EnumRef.ВидыСчетовРеглУчета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/Enums/СпособыНастройкиСчетовУчета/СпособыНастройкиСчетовУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыНастройкиСчетовУчета</name>
  <enumValues>
    <name>ОдинаковоДляВсехДокументов</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальноДляКаждогоДокумента</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/ВидыСчетовРеглУчета/ВидыСчетовРеглУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСчетовРеглУчета</name>
  <enumValues>
    <name>АвансыВыданные</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученные</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродаж</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродажКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>Доходы</name>
  </enumValues>
  <enumValues>
    <name>НаСкладе</name>
  </enumValues>
  <enumValues>
    <name>НДСпоПриобретеннымЦенностям</name>
  </enumValues>
  <enumValues>
    <name>НДСПриДоходах</name>
  </enumValues>
  <enumValues>
    <name>НДСПриЗакупке</name>
  </enumValues>
  <enumValues>
    <name>НДСПриОтгрузкеБезПереходаПраваСобственности</name>
  </enumValues>
  <enumValues>
    <name>НДСПриПродаже</name>
  </enumValues>
  <enumValues>
    <name>НДСПриПродажеКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>РеализацияБезПереходаПраваСобственности</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеОперации</name>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
  </enumValues>
  <enumValues>
    <name>РасходыМЦ</name>
  </enumValues>
  <enumValues>
    <name>УдалитьРасчетыПоВознаграждению</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоПодарочнымСертификатам</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоПретензиям</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентами</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентамиТара</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПоставщиками</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПоставщикамиТара</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродаж</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродажКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>ТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ТМЦВЭксплуатацииЗаБалансом</name>
  </enumValues>
  <enumValues>
    <name>СписаниеРасходовОСНО</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеАктивыПассивы</name>
  </enumValues>
  <enumValues>
    <name>СписаниеРасходовЕНВД</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредства</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияВНА</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияВНА_ЦФ</name>
  </enumValues>
  <enumValues>
    <name>ВыбытиеВНА</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьВНА</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьВНА_ЦФ</name>
  </enumValues>
  <enumValues>
    <name>РезервДоОценкиВНА</name>
  </enumValues>
  <enumValues>
    <name>ЗабалансовыйУчетВНА</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКредиторамиОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКредиторамиКомиссия</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКредиторамиПроценты</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСДебиторамиОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСДебиторамиКомиссия</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСДебиторамиПроценты</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродажЕНВД</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродажЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ЗатратыНаПриобретениеТМЦ</name>
  </enumValues>
  <enumValues>
    <name>НеотфактурованныеПоставки</name>
  </enumValues>
  <enumValues>
    <name>Резервы</name>
  </enumValues>
  <enumValues>
    <name>ЛизинговыеУслуги</name>
  </enumValues>
  <enumValues>
    <name>ОбеспечительныйПлатежПоЛизингу</name>
  </enumValues>
  <enumValues>
    <name>ВыкупПредметаЛизинга</name>
  </enumValues>
  <enumValues>
    <name>АрендныеОбязательстваПоЛизингу</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/InformationRegisters/ПорядокОтраженияРасходов/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Не ЗначениеЗаполнено(Запись.Документ)
		 И Запись.Документ <> Неопределено Тогда
			Запись.Документ = Неопределено;
		КонецЕсли;
		
		Если Запись.СпособНастройкиСчетовУчета.Пустая() Тогда
			Запись.СпособНастройкиСчетовУчета = Перечисления.СпособыНастройкиСчетовУчета.ОдинаковоДляВсехДокументов;
		КонецЕсли;
		
		ВидыСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные;
		
		Если ЗначениеЗаполнено(Запись.СчетУчета) Тогда
			
			Если Не Запись.СчетУчета.ВидыСубконто.Найти(ВидыСубконто.СтатьиЗатрат) = Неопределено Тогда
				Запись.ВидСубконто = ВидыСубконто.СтатьиЗатрат;
				
			ИначеЕсли Не Запись.СчетУчета.ВидыСубконто.Найти(ВидыСубконто.РасходыБудущихПериодов) = Неопределено Тогда
				Запись.ВидСубконто = ВидыСубконто.РасходыБудущихПериодов;
				
			ИначеЕсли Не Запись.СчетУчета.ВидыСубконто.Найти(ВидыСубконто.ПрочиеДоходыИРасходы) = Неопределено Тогда
				Запись.ВидСубконто = ВидыСубконто.ПрочиеДоходыИРасходы;
				
			Иначе
				Запись.ВидСубконто = Неопределено;
				
			КонецЕсли;
			
		Иначе
			Запись.ВидСубконто = Неопределено;
			
		КонецЕсли;
		
		Если Запись.СпособНастройкиСчетовУчета = Перечисления.СпособыНастройкиСчетовУчета.ОдинаковоДляВсехДокументов Тогда
			Если ЗначениеЗаполнено(Запись.СчетУчетаНУ) Тогда
				Запись.СчетУчетаНУ = Неопределено;
			КонецЕсли;
			Если ЗначениеЗаполнено(Запись.СтатьяРасходовНУ) Тогда
				Запись.СтатьяРасходовНУ = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Запись.СчетУчетаНУ) Тогда
			
			Если Не Запись.СчетУчетаНУ.ВидыСубконто.Найти(ВидыСубконто.СтатьиЗатрат) = Неопределено Тогда
				Запись.ВидСубконтоНУ = ВидыСубконто.СтатьиЗатрат;
				
			ИначеЕсли Не Запись.СчетУчетаНУ.ВидыСубконто.Найти(ВидыСубконто.РасходыБудущихПериодов) = Неопределено Тогда
				Запись.ВидСубконтоНУ = ВидыСубконто.РасходыБудущихПериодов;
				
			ИначеЕсли Не Запись.СчетУчетаНУ.ВидыСубконто.Найти(ВидыСубконто.ПрочиеДоходыИРасходы) = Неопределено Тогда
				Запись.ВидСубконтоНУ = ВидыСубконто.ПрочиеДоходыИРасходы;
				
			Иначе
				Запись.ВидСубконтоНУ = Неопределено;
				
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(Запись.СтатьяРасходовНУ) Тогда
			Запись.ВидСубконтоНУ = ВидыСубконто.РасходыБудущихПериодов;
			
		Иначе
			Запись.ВидСубконтоНУ = Неопределено;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если Отказ ИЛИ ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорядокОтраженияРасходов.Организация,
	|	ПорядокОтраженияРасходов.СтатьяРасходов,
	|	ПорядокОтраженияРасходов.Подразделение,
	|	ПорядокОтраженияРасходов.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		И ПорядокОтраженияРасходов.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		И ПорядокОтраженияРасходов.Подразделение = НЕОПРЕДЕЛЕНО КАК ЭтоОбщаяНастройка,
	|	ПорядокОтраженияРасходов.СчетУчета,
	|	ПорядокОтраженияРасходов.СчетСписанияОСНО,
	|	ПорядокОтраженияРасходов.СчетСписанияЕНВД
	|ПОМЕСТИТЬ ТаблицаНовыхДанных
	|ИЗ
	|	&ТаблицаНовыхДанных КАК ПорядокОтраженияРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНовыхДанных.Организация,
	|	ТаблицаНовыхДанных.Подразделение КАК МестоУчета,
	|	ТаблицаНовыхДанных.СтатьяРасходов КАК АналитикаУчета,
	|	ТаблицаНовыхДанных.ЭтоОбщаяНастройка КАК ЭтоОбщаяНастройка,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчета
	|ПОМЕСТИТЬ ДанныеЗаполненныхСчетовРегистра
	|ИЗ
	|	ТаблицаНовыхДанных КАК ТаблицаНовыхДанных
	|ГДЕ
	|	ТаблицаНовыхДанных.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаНовыхДанных.Организация,
	|	ТаблицаНовыхДанных.Подразделение,
	|	ТаблицаНовыхДанных.СтатьяРасходов,
	|	ТаблицаНовыхДанных.ЭтоОбщаяНастройка КАК ЭтоОбщаяНастройка,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СписаниеРасходовОСНО)
	|ИЗ
	|	ТаблицаНовыхДанных КАК ТаблицаНовыхДанных
	|ГДЕ
	|	ТаблицаНовыхДанных.СчетСписанияОСНО <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаНовыхДанных.Организация,
	|	ТаблицаНовыхДанных.Подразделение,
	|	ТаблицаНовыхДанных.СтатьяРасходов,
	|	ТаблицаНовыхДанных.ЭтоОбщаяНастройка КАК ЭтоОбщаяНастройка,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СписаниеРасходовЕНВД)
	|ИЗ
	|	ТаблицаНовыхДанных КАК ТаблицаНовыхДанных
	|ГДЕ
	|	ТаблицаНовыхДанных.СчетСписанияЕНВД <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)";
	Запрос.УстановитьПараметр("ТаблицаНовыхДанных", ЭтотОбъект.Выгрузить());
	Запрос.Выполнить();
	РегистрыСведений.СчетаРеглУчетаТребующиеНастройки.ОчиститьПриЗаписиРегистра(Запрос.МенеджерВременныхТаблиц);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
